zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MSCM.h
/*
** ###################################################################
**     Processors:          MCXE32BMLL_cm7_core0
**                          MCXE32BMLL_cm7_core1
**                          MCXE32BMPB_cm7_core0
**                          MCXE32BMPB_cm7_core1
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260625
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MSCM
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_MSCM.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for MSCM
 *
 * CMSIS Peripheral Access Layer for MSCM
 */

#if !defined(PERI_MSCM_H_)
#define PERI_MSCM_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE32BMLL_cm7_core0) || defined(CPU_MCXE32BMPB_cm7_core0))
#include "MCXE32B_cm7_core0_COMMON.h"
#elif (defined(CPU_MCXE32BMLL_cm7_core1) || defined(CPU_MCXE32BMPB_cm7_core1))
#include "MCXE32B_cm7_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- MSCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCM_Peripheral_Access_Layer MSCM Peripheral Access Layer
 * @{
 */

/** MSCM - Size of Registers Arrays */
#define MSCM_CP_COUNT                             2u
#define MSCM_IRSPRC_COUNT                         240u

/** MSCM - Register Layout Typedef */
typedef struct {
  __I  uint32_t CPxTYPE;                           /**< Processor X Type, offset: 0x0 */
  __I  uint32_t CPxNUM;                            /**< Processor X Number, offset: 0x4 */
  __I  uint32_t CPxREV;                            /**< Processor X Revision, offset: 0x8 */
  __I  uint32_t CPxCFG0;                           /**< Processor X Configuration 0, offset: 0xC */
  __I  uint32_t CPxCFG1;                           /**< Processor X Configuration 1, offset: 0x10 */
  __I  uint32_t CPxCFG2;                           /**< Processor X Configuration 2, offset: 0x14 */
  __I  uint32_t CPxCFG3;                           /**< Processor x Configuration 3, offset: 0x18 */
       uint8_t RESERVED_0[4];
  struct {                                         /* offset: 0x20, array step: 0x20 */
    __I  uint32_t TYPE;                              /**< Processor 0 Type..Processor 1 Type, array offset: 0x20, array step: 0x20 */
    __I  uint32_t NUM;                               /**< Processor 0 Number..Processor 1 Number, array offset: 0x24, array step: 0x20 */
    __I  uint32_t COUNT;                             /**< Processor 0 Count..Processor 1 Count, array offset: 0x28, array step: 0x20 */
    __I  uint32_t CFG0;                              /**< Processor 0 Configuration 0..Processor 1 Configuration 0, array offset: 0x2C, array step: 0x20 */
    __I  uint32_t CFG1;                              /**< Processor 0 Configuration 1..Processor 1 Configuration 1, array offset: 0x30, array step: 0x20 */
    __I  uint32_t CFG2;                              /**< Processor 0 Configuration 2..Processor 1 Configuration 2, array offset: 0x34, array step: 0x20 */
    __I  uint32_t CFG3;                              /**< Processor 0 Configuration 3..Processor 1 Configuration 3, array offset: 0x38, array step: 0x20 */
         uint8_t RESERVED_0[4];
  } CP[MSCM_CP_COUNT];
       uint8_t RESERVED_1[416];
  __IO uint32_t IRCP0ISR0;                         /**< Interrupt Router CP0 Interrupt Status, offset: 0x200 */
  __IO uint32_t IRCP0IGR0;                         /**< Interrupt Router CP0 Interrupt Generation, offset: 0x204 */
  __IO uint32_t IRCP0ISR1;                         /**< Interrupt Router CP0 Interrupt Status, offset: 0x208 */
  __IO uint32_t IRCP0IGR1;                         /**< Interrupt Router CP0 Interrupt Generation, offset: 0x20C */
  __IO uint32_t IRCP0ISR2;                         /**< Interrupt Router CP0 Interrupt Status, offset: 0x210 */
  __IO uint32_t IRCP0IGR2;                         /**< Interrupt Router CP0 Interrupt Generation, offset: 0x214 */
  __IO uint32_t IRCP0ISR3;                         /**< Interrupt Router CP0 Interrupt Status, offset: 0x218 */
  __IO uint32_t IRCP0IGR3;                         /**< Interrupt Router CP0 Interrupt Generation, offset: 0x21C */
  __IO uint32_t IRCP1ISR0;                         /**< Interrupt Router CP1 Interrupt Status, offset: 0x220 */
  __IO uint32_t IRCP1IGR0;                         /**< Interrupt Router CP1 Interrupt Generation, offset: 0x224 */
  __IO uint32_t IRCP1ISR1;                         /**< Interrupt Router CP1 Interrupt Status, offset: 0x228 */
  __IO uint32_t IRCP1IGR1;                         /**< Interrupt Router CP1 Interrupt Generation, offset: 0x22C */
  __IO uint32_t IRCP1ISR2;                         /**< Interrupt Router CP1 Interrupt Status, offset: 0x230 */
  __IO uint32_t IRCP1IGR2;                         /**< Interrupt Router CP1 Interrupt Generation, offset: 0x234 */
  __IO uint32_t IRCP1ISR3;                         /**< Interrupt Router CP1 Interrupt Status, offset: 0x238 */
  __IO uint32_t IRCP1IGR3;                         /**< Interrupt Router CP1 Interrupt Generation, offset: 0x23C */
       uint8_t RESERVED_2[448];
  __IO uint32_t IRCPCFG;                           /**< Interrupt Router Configuration, offset: 0x400 */
       uint8_t RESERVED_3[508];
  __IO uint32_t ENEDC;                             /**< Enable Interconnect Error Detection, offset: 0x600 */
       uint8_t RESERVED_4[252];
  __IO uint32_t IAHBCFGREG;                        /**< AHB Gasket Configuration, offset: 0x700 */
       uint8_t RESERVED_5[380];
  __IO uint16_t IRSPRC[MSCM_IRSPRC_COUNT];         /**< Interrupt Router Shared Peripheral Routing Control, array offset: 0x880, array step: 0x2 */
} MSCM_Type;

/* ----------------------------------------------------------------------------
   -- MSCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCM_Register_Masks MSCM Register Masks
 * @{
 */

/*! @name CPxTYPE - Processor X Type */
/*! @{ */

#define MSCM_CPxTYPE_PERSONALITY_MASK            (0xFFFFFFFFU)
#define MSCM_CPxTYPE_PERSONALITY_SHIFT           (0U)
/*! PERSONALITY - Personality of CPx */
#define MSCM_CPxTYPE_PERSONALITY(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_CPxTYPE_PERSONALITY_SHIFT)) & MSCM_CPxTYPE_PERSONALITY_MASK)
/*! @} */

/*! @name CPxNUM - Processor X Number */
/*! @{ */

#define MSCM_CPxNUM_CPN_MASK                     (0x3U)
#define MSCM_CPxNUM_CPN_SHIFT                    (0U)
/*! CPN - Processor Number
 *  0b00..Cortex-M7 core 0
 *  0b01..Cortex-M7 core 1
 */
#define MSCM_CPxNUM_CPN(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_CPxNUM_CPN_SHIFT)) & MSCM_CPxNUM_CPN_MASK)
/*! @} */

/*! @name CPxREV - Processor X Revision */
/*! @{ */

#define MSCM_CPxREV_RYPZ_MASK                    (0xFFU)
#define MSCM_CPxREV_RYPZ_SHIFT                   (0U)
/*! RYPZ - Processor Revision */
#define MSCM_CPxREV_RYPZ(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_CPxREV_RYPZ_SHIFT)) & MSCM_CPxREV_RYPZ_MASK)
/*! @} */

/*! @name CPxCFG0 - Processor X Configuration 0 */
/*! @{ */

