zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MSCM.h
#define MSCM_CPxCFG0_DCWY_MASK                   (0xFFU)
#define MSCM_CPxCFG0_DCWY_SHIFT                  (0U)
/*! DCWY - L1 Data Cache Ways */
#define MSCM_CPxCFG0_DCWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG0_DCWY_SHIFT)) & MSCM_CPxCFG0_DCWY_MASK)

#define MSCM_CPxCFG0_DCSZ_MASK                   (0xFF00U)
#define MSCM_CPxCFG0_DCSZ_SHIFT                  (8U)
/*! DCSZ - L1 Data Cache Size */
#define MSCM_CPxCFG0_DCSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG0_DCSZ_SHIFT)) & MSCM_CPxCFG0_DCSZ_MASK)

#define MSCM_CPxCFG0_ICWY_MASK                   (0xFF0000U)
#define MSCM_CPxCFG0_ICWY_SHIFT                  (16U)
/*! ICWY - L1 Instruction Cache Ways */
#define MSCM_CPxCFG0_ICWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG0_ICWY_SHIFT)) & MSCM_CPxCFG0_ICWY_MASK)

#define MSCM_CPxCFG0_ICSZ_MASK                   (0xFF000000U)
#define MSCM_CPxCFG0_ICSZ_SHIFT                  (24U)
/*! ICSZ - Level 1 Instruction Cache Size */
#define MSCM_CPxCFG0_ICSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG0_ICSZ_SHIFT)) & MSCM_CPxCFG0_ICSZ_MASK)
/*! @} */

/*! @name CPxCFG1 - Processor X Configuration 1 */
/*! @{ */

#define MSCM_CPxCFG1_L2WY_MASK                   (0xFF0000U)
#define MSCM_CPxCFG1_L2WY_SHIFT                  (16U)
/*! L2WY - L2 Cache Ways */
#define MSCM_CPxCFG1_L2WY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG1_L2WY_SHIFT)) & MSCM_CPxCFG1_L2WY_MASK)

#define MSCM_CPxCFG1_L2SZ_MASK                   (0xFF000000U)
#define MSCM_CPxCFG1_L2SZ_SHIFT                  (24U)
/*! L2SZ - L2 Cache Size */
#define MSCM_CPxCFG1_L2SZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG1_L2SZ_SHIFT)) & MSCM_CPxCFG1_L2SZ_MASK)
/*! @} */

/*! @name CPxCFG2 - Processor X Configuration 2 */
/*! @{ */

#define MSCM_CPxCFG2_ITCMSZ_MASK                 (0xFF0000U)
#define MSCM_CPxCFG2_ITCMSZ_SHIFT                (16U)
/*! ITCMSZ - Instruction Tightly Coupled Memory Size */
#define MSCM_CPxCFG2_ITCMSZ(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG2_ITCMSZ_SHIFT)) & MSCM_CPxCFG2_ITCMSZ_MASK)

#define MSCM_CPxCFG2_DTCMSZ_MASK                 (0xFF000000U)
#define MSCM_CPxCFG2_DTCMSZ_SHIFT                (24U)
/*! DTCMSZ - Tightly Coupled Data Memory Size */
#define MSCM_CPxCFG2_DTCMSZ(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG2_DTCMSZ_SHIFT)) & MSCM_CPxCFG2_DTCMSZ_MASK)
/*! @} */

/*! @name CPxCFG3 - Processor x Configuration 3 */
/*! @{ */

#define MSCM_CPxCFG3_FPU_MASK                    (0x1U)
#define MSCM_CPxCFG3_FPU_SHIFT                   (0U)
/*! FPU - Floating Point Unit
 *  0b0..Not provided
 *  0b1..Provided
 */
#define MSCM_CPxCFG3_FPU(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_FPU_SHIFT)) & MSCM_CPxCFG3_FPU_MASK)

#define MSCM_CPxCFG3_SIMD_MASK                   (0x2U)
#define MSCM_CPxCFG3_SIMD_SHIFT                  (1U)
/*! SIMD - SIMD/NEON Instruction Support
 *  0b0..Not included
 *  0b1..Included
 */
#define MSCM_CPxCFG3_SIMD(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_SIMD_SHIFT)) & MSCM_CPxCFG3_SIMD_MASK)

#define MSCM_CPxCFG3_MMU_MASK                    (0x4U)
#define MSCM_CPxCFG3_MMU_SHIFT                   (2U)
/*! MMU - Memory Management Unit
 *  0b0..Not supported
 *  0b1..Supported
 */
#define MSCM_CPxCFG3_MMU(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_MMU_SHIFT)) & MSCM_CPxCFG3_MMU_MASK)

#define MSCM_CPxCFG3_CMP_MASK                    (0x8U)
#define MSCM_CPxCFG3_CMP_SHIFT                   (3U)
/*! CMP - Core Memory Protection Unit
 *  0b0..Not included
 *  0b1..Included
 */
#define MSCM_CPxCFG3_CMP(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_CMP_SHIFT)) & MSCM_CPxCFG3_CMP_MASK)

#define MSCM_CPxCFG3_CPY_MASK                    (0x10U)
#define MSCM_CPxCFG3_CPY_SHIFT                   (4U)
/*! CPY - Cryptography
 *  0b0..Not supported
 *  0b1..Supported
 */
#define MSCM_CPxCFG3_CPY(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_CPY_SHIFT)) & MSCM_CPxCFG3_CPY_MASK)
/*! @} */

/*! @name TYPE - Processor 0 Type..Processor 1 Type */
/*! @{ */

#define MSCM_TYPE_PERSONALITY_MASK               (0xFFFFFFFFU)
#define MSCM_TYPE_PERSONALITY_SHIFT              (0U)
/*! PERSONALITY - Processor Personality */
#define MSCM_TYPE_PERSONALITY(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_TYPE_PERSONALITY_SHIFT)) & MSCM_TYPE_PERSONALITY_MASK)
/*! @} */

/* The count of MSCM_TYPE */
#define MSCM_TYPE_COUNT                          (2U)

/*! @name NUM - Processor 0 Number..Processor 1 Number */
/*! @{ */

#define MSCM_NUM_CPN_MASK                        (0x3U)
#define MSCM_NUM_CPN_SHIFT                       (0U)
/*! CPN - Processor Number */
#define MSCM_NUM_CPN(x)                          (((uint32_t)(((uint32_t)(x)) << MSCM_NUM_CPN_SHIFT)) & MSCM_NUM_CPN_MASK)
/*! @} */

/* The count of MSCM_NUM */
#define MSCM_NUM_COUNT                           (2U)

/*! @name COUNT - Processor 0 Count..Processor 1 Count */
/*! @{ */

#define MSCM_COUNT_RYPZ_MASK                     (0xFFU)
#define MSCM_COUNT_RYPZ_SHIFT                    (0U)
/*! RYPZ - Processor Revision */
#define MSCM_COUNT_RYPZ(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_COUNT_RYPZ_SHIFT)) & MSCM_COUNT_RYPZ_MASK)
/*! @} */

/* The count of MSCM_COUNT */
#define MSCM_COUNT_COUNT                         (2U)

/*! @name CFG0 - Processor 0 Configuration 0..Processor 1 Configuration 0 */
/*! @{ */

#define MSCM_CFG0_DCWY_MASK                      (0xFFU)
#define MSCM_CFG0_DCWY_SHIFT                     (0U)
/*! DCWY - L1 Data Cache Ways */
#define MSCM_CFG0_DCWY(x)                        (((uint32_t)(((uint32_t)(x)) << MSCM_CFG0_DCWY_SHIFT)) & MSCM_CFG0_DCWY_MASK)

#define MSCM_CFG0_DCSZ_MASK                      (0xFF00U)
#define MSCM_CFG0_DCSZ_SHIFT                     (8U)
/*! DCSZ - L1 Data Cache Size */
#define MSCM_CFG0_DCSZ(x)                        (((uint32_t)(((uint32_t)(x)) << MSCM_CFG0_DCSZ_SHIFT)) & MSCM_CFG0_DCSZ_MASK)

#define MSCM_CFG0_ICWY_MASK                      (0xFF0000U)
#define MSCM_CFG0_ICWY_SHIFT                     (16U)
/*! ICWY - Level 1 Instruction Cache Ways */
#define MSCM_CFG0_ICWY(x)                        (((uint32_t)(((uint32_t)(x)) << MSCM_CFG0_ICWY_SHIFT)) & MSCM_CFG0_ICWY_MASK)

#define MSCM_CFG0_ICSZ_MASK                      (0xFF000000U)
#define MSCM_CFG0_ICSZ_SHIFT                     (24U)
/*! ICSZ - Level 1 Instruction Cache Size */
#define MSCM_CFG0_ICSZ(x)                        (((uint32_t)(((uint32_t)(x)) << MSCM_CFG0_ICSZ_SHIFT)) & MSCM_CFG0_ICSZ_MASK)
/*! @} */

