zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MSCM.h
#define MSCM_IRCPCFG_CP1_TR_MASK                 (0x2U)
#define MSCM_IRCPCFG_CP1_TR_SHIFT                (1U)
/*! CP1_TR - CP1 as Trusted Core
 *  0b0..Not trusted
 *  0b1..Trusted
 */
#define MSCM_IRCPCFG_CP1_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP1_TR_SHIFT)) & MSCM_IRCPCFG_CP1_TR_MASK)

#define MSCM_IRCPCFG_LOCK_MASK                   (0x80000000U)
#define MSCM_IRCPCFG_LOCK_SHIFT                  (31U)
/*! LOCK - Lock
 *  0b0..Register can be written by any privileged write
 *  0b1..Register is locked (read-only) until the next reset
 */
#define MSCM_IRCPCFG_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_LOCK_SHIFT)) & MSCM_IRCPCFG_LOCK_MASK)
/*! @} */

/*! @name ENEDC - Enable Interconnect Error Detection */
/*! @{ */

#define MSCM_ENEDC_EN_RD_CM7_0_AHBM_MASK         (0x1U)
#define MSCM_ENEDC_EN_RD_CM7_0_AHBM_SHIFT        (0U)
/*! EN_RD_CM7_0_AHBM - Enable Read Data Check Cortex-M7_0_AHBM
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_RD_CM7_0_AHBM(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_CM7_0_AHBM_SHIFT)) & MSCM_ENEDC_EN_RD_CM7_0_AHBM_MASK)

#define MSCM_ENEDC_EN_RD_CM7_0_AHBP_MASK         (0x2U)
#define MSCM_ENEDC_EN_RD_CM7_0_AHBP_SHIFT        (1U)
/*! EN_RD_CM7_0_AHBP - Enable Read Data Check Cortex-M7_0_AHBP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_RD_CM7_0_AHBP(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_CM7_0_AHBP_SHIFT)) & MSCM_ENEDC_EN_RD_CM7_0_AHBP_MASK)

#define MSCM_ENEDC_EN_RD_EDMA_MASK               (0x4U)
#define MSCM_ENEDC_EN_RD_EDMA_SHIFT              (2U)
/*! EN_RD_EDMA - Enable Read Data Check eDMA
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_RD_EDMA(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_EDMA_SHIFT)) & MSCM_ENEDC_EN_RD_EDMA_MASK)

#define MSCM_ENEDC_EN_RD_HSE_MASK                (0x10U)
#define MSCM_ENEDC_EN_RD_HSE_SHIFT               (4U)
/*! EN_RD_HSE - Enable Read Data Check HSE
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_RD_HSE(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_HSE_SHIFT)) & MSCM_ENEDC_EN_RD_HSE_MASK)

#define MSCM_ENEDC_EN_RD_EMAC_MASK               (0x20U)
#define MSCM_ENEDC_EN_RD_EMAC_SHIFT              (5U)
/*! EN_RD_EMAC - Enable Read Data Check EMAC
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_RD_EMAC(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_EMAC_SHIFT)) & MSCM_ENEDC_EN_RD_EMAC_MASK)

#define MSCM_ENEDC_EN_RD_CM7_1_AHBM_MASK         (0x40U)
#define MSCM_ENEDC_EN_RD_CM7_1_AHBM_SHIFT        (6U)
/*! EN_RD_CM7_1_AHBM - Enable Read Data Check Cortex-M7_1_AHBM
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_RD_CM7_1_AHBM(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_CM7_1_AHBM_SHIFT)) & MSCM_ENEDC_EN_RD_CM7_1_AHBM_MASK)

#define MSCM_ENEDC_EN_RD_CM7_1_AHBP_MASK         (0x80U)
#define MSCM_ENEDC_EN_RD_CM7_1_AHBP_SHIFT        (7U)
/*! EN_RD_CM7_1_AHBP - Enable Read Data Check Cortex-M7_1_AHBP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_RD_CM7_1_AHBP(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_CM7_1_AHBP_SHIFT)) & MSCM_ENEDC_EN_RD_CM7_1_AHBP_MASK)

#define MSCM_ENEDC_EN_RD_TCM_MASK                (0x100U)
#define MSCM_ENEDC_EN_RD_TCM_SHIFT               (8U)
/*! EN_RD_TCM - Enable Read Data Check TCM
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_RD_TCM(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_TCM_SHIFT)) & MSCM_ENEDC_EN_RD_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_PFLASH_PORT0_MASK      (0x200U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT0_SHIFT     (9U)
/*! EN_ADD_PFLASH_PORT0 - Enable Address Check P_FLASH_PORT0
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT0(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PFLASH_PORT0_SHIFT)) & MSCM_ENEDC_EN_ADD_PFLASH_PORT0_MASK)

#define MSCM_ENEDC_EN_ADD_PFLASH_PORT1_MASK      (0x400U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT1_SHIFT     (10U)
/*! EN_ADD_PFLASH_PORT1 - Enable Address Check P_FLASH_PORT1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT1(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PFLASH_PORT1_SHIFT)) & MSCM_ENEDC_EN_ADD_PFLASH_PORT1_MASK)

#define MSCM_ENEDC_EN_ADD_PFLASH_PORT2_MASK      (0x800U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT2_SHIFT     (11U)
/*! EN_ADD_PFLASH_PORT2 - Enable Address Check P_FLASH_PORT2
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT2(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PFLASH_PORT2_SHIFT)) & MSCM_ENEDC_EN_ADD_PFLASH_PORT2_MASK)

#define MSCM_ENEDC_EN_WR_PRAM0_MASK              (0x1000U)
#define MSCM_ENEDC_EN_WR_PRAM0_SHIFT             (12U)
/*! EN_WR_PRAM0 - Enable Write Data Check PRAM0
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_WR_PRAM0(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_PRAM0_SHIFT)) & MSCM_ENEDC_EN_WR_PRAM0_MASK)

#define MSCM_ENEDC_EN_ADD_PRAM0_MASK             (0x2000U)
#define MSCM_ENEDC_EN_ADD_PRAM0_SHIFT            (13U)
/*! EN_ADD_PRAM0 - Enable Address Check PRAM0
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_ADD_PRAM0(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PRAM0_SHIFT)) & MSCM_ENEDC_EN_ADD_PRAM0_MASK)

#define MSCM_ENEDC_EN_WR_PRAM1_MASK              (0x4000U)
#define MSCM_ENEDC_EN_WR_PRAM1_SHIFT             (14U)
/*! EN_WR_PRAM1 - Enable Write Data Check PRAM1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_WR_PRAM1(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_PRAM1_SHIFT)) & MSCM_ENEDC_EN_WR_PRAM1_MASK)

#define MSCM_ENEDC_EN_ADD_PRAM1_MASK             (0x8000U)
#define MSCM_ENEDC_EN_ADD_PRAM1_SHIFT            (15U)
/*! EN_ADD_PRAM1 - Enable Address Check PRAM1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_ADD_PRAM1(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PRAM1_SHIFT)) & MSCM_ENEDC_EN_ADD_PRAM1_MASK)

#define MSCM_ENEDC_EN_WR_TCM_MASK                (0x10000U)
#define MSCM_ENEDC_EN_WR_TCM_SHIFT               (16U)
/*! EN_WR_TCM - Enable Write Data Check TCM
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_WR_TCM(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_TCM_SHIFT)) & MSCM_ENEDC_EN_WR_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_TCM_MASK               (0x20000U)
#define MSCM_ENEDC_EN_ADD_TCM_SHIFT              (17U)
/*! EN_ADD_TCM - Enable Address Check TCM
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_ADD_TCM(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_TCM_SHIFT)) & MSCM_ENEDC_EN_ADD_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_QSPI_MASK              (0x80000U)
#define MSCM_ENEDC_EN_ADD_QSPI_SHIFT             (19U)
/*! EN_ADD_QSPI - Enable Address Check QuadSPI
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MSCM_ENEDC_EN_ADD_QSPI(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_QSPI_SHIFT)) & MSCM_ENEDC_EN_ADD_QSPI_MASK)

